import { NextResponse } from "next/server";

const replacer = [
    ['й', 'й̷'],
    ['ц', 'ц̷'],
    ['у', 'у̷'],
    ['к', 'к̷'],
    ['е', 'е̷'],
    ['н', 'н̷'],
    ['г', 'г̷'],
    ['ш', 'ш̷'],
    ['щ', 'щ̷'],
    ['з', 'з̷'],
    ['х', 'х̷'],
    ['ъ', 'ъ̷'],
    ['ф', 'ф̷'],
    ['ы', 'ы̷'],
    ['в', 'в̷'],
    ['а', 'а̷'],
    ['п', 'п̷'],
    ['р', 'р̷'],
    ['о', 'о̷'],
    ['л', 'л̷'],
    ['д', 'д̷'],
    ['ж', 'ж̷'],
    ['э', 'э̷'],
    ['я', 'я̷'],
    ['ч', 'ч̷'],
    ['с', 'с̷'],
    ['м', 'м̷'],
    ['и', 'и̷'],
    ['т', 'т̷'],
    ['ь', 'ь̷'],
    ['б', 'б̷'],
    ['ю', 'ю̷'],
    ['Й', 'Й̷'],
    ['Ц', 'Ц̷'],
    ['У', 'У̷'],
    ['К', 'К̷'],
    ['Е', 'Е̷'],
    ['Н', 'Н̷'],
    ['Г', 'Г̷'],
    ['Ш', 'Ш̷'],
    ['Щ', 'Щ̷'],
    ['З', 'З̷'],
    ['Х', 'Х̷'],
    ['Ъ', 'Ъ̷'],
    ['Ф', 'Ф̷'],
    ['Ы', 'Ы̷'],
    ['В', 'В̷'],
    ['А', 'А̷'],
    ['П', 'П̷'],
    ['Р', 'Р̷'],
    ['О', 'О̷'],
    ['Л', 'Л̷'],
    ['Д', 'Д̷'],
    ['Ж', 'Ж̷'],
    ['Э', 'Э̷'],
    ['Я', 'Я̷'],
    ['Ч', 'Ч̷'],
    ['С', 'С̷'],
    ['М', 'М̷'],
    ['И', 'И̷'],
    ['Т', 'Т̷'],
    ['Ь', 'Ь̷'],
    ['Б', 'Б̷'],
    ['Ю', 'Ю̷'],
];



const methodSCRATCHED = (text: string) => {
    const words = text.split(' ');

    const formatted = words.map((item) => {
        let finalWord = item;

        replacer.forEach((item, index) => {
            finalWord = finalWord.replaceAll(item[0], item[1]);
        });

        return finalWord;
    });

    return NextResponse.json(
        {
            result: {
                formatted: formatted.join(' '),
            },
        },
        {
            status: 200,
        }
    );
};


export default methodSCRATCHED;